perf/steps.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-node'

  pool: 50

  phases:
    - name: WarmUp
      duration: 10
      arrivalRate: 5

    - name: Step 1
      duration: 50
      arrivalRate: 200
    - name: Step 2
      duration: 50
      arrivalRate: 400
    - name: Step 3
      duration: 50
      arrivalRate: 800
    - name: Step 4
      duration: 50
      arrivalRate: 1600

    - name: WindDown
      duration: 10
      arrivalRate: 5

scenarios:
  - name: endpoint
    flow:
      - get:
          url: '/ping'